tsung/tsung_userflow33.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="justinpagecachevh.eba-vxqrh727.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="3000"></option>
  </options>

  <sessions>
    <session name="user_workflow3.3" weight="100" type="ts_http">
        <setdynvars sourcetype="random_number" start="1" end="100000">
            <var name="rand_user"/>
        </setdynvars>

        <!-- Navigate to login/signup page -->
        <request>
            <dyn_variable name="signup_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http method="GET" version="1.1" url="/login"></http>
        </request>

        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(signup_authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
            <var name="encoded_signup_authenticity_token" />
        </setdynvars>

        <!-- Signup new student user -->
        <request subst="true">
            <http url="/signup" version="1.1" method="POST"
                contents="authenticity_token=%%_encoded_signup_authenticity_token%%&amp;username=test_user%%_rand_user%%&amp;password=123456789&amp;role=Student&amp;commit=Sign+Up"
                content_type="application/x-www-form-urlencoded">
            </http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
            <dyn_variable name="post_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http url="/posts" version="1.1" method="GET"/>
        </request>

        <!-- Student creates post -->
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(post_authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
            <var name="encoded_post_authenticity_token" />
        </setdynvars>

        <request subst="true">
            <http url="/posts" version="1.1" method="POST"
                contents="authenticity_token=%%_encoded_post_authenticity_token%%&amp;post%5Bbody%5D=Thisismypost&amp;commit=Create+Post"
                content_type="application/x-www-form-urlencoded">
            </http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <!-- Student creates a second post -->
        <request subst="true">
            <dyn_variable name="post_authenticity_token2" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http url="/posts" version="1.1" method="GET"/>
        </request>

        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(post_authenticity_token2,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
            <var name="encoded_post_authenticity_token2" />
        </setdynvars>

        <request subst="true">
            <http url="/posts" version="1.1" method="POST"
                contents="authenticity_token=%%_encoded_post_authenticity_token2%%&amp;post%5Bbody%5D=Thisismysecondpost&amp;commit=Create+Post"
                content_type="application/x-www-form-urlencoded">
            </http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <!-- DESTROY POST-->
        <!-- Navigate to login/signup page -->

        <setdynvars sourcetype="random_number" start="1" end="100000">
            <var name="rand_user"/>
        </setdynvars>
        
        <request>
          <dyn_variable name="signup_authenticity_token2" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
          <http method="GET" version="1.1" url="/login"></http>
        </request>

        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(signup_authenticity_token2,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
          <var name="encoded_signup_authenticity_token2" />
        </setdynvars>

        <!-- Signup new instructor user -->
        <request subst="true">
            <http url="/signup" version="1.1" method="POST"
                contents="authenticity_token=%%_encoded_signup_authenticity_token2%%&amp;username=test_use_instructor%%_rand_user%%&amp;password=123456789&amp;role=Instructor&amp;commit=Sign+Up"
                content_type="application/x-www-form-urlencoded">
            </http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
          <dyn_variable name="post_id"  xpath="//div[@class='invisible']/text()"></dyn_variable>
          <http url="/posts" version="1.1" method="GET"/>
        </request>
    

        <!-- Delete a post -->
        <thinktime value="10" random="true"></thinktime>

        <request subst="true">
            <dyn_variable name="delete_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http url='/posts' method='GET'/>
        </request>

        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(delete_authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
          <var name="encoded_delete_authenticity_token" />
        </setdynvars>   

        <request subst="true">
            <http url='/posts/%%_post_id%%' version='1.1' method='DELETE'
                contents="authenticity_token=%%_encoded_delete_authenticity_token%%"
                content_type="application/x-www-form-urlencoded">
            </http>
        </request>

    </session>

  </sessions>
</tsung>